export const romaKana = [
    // Sokuon
    // ["kka", "っか"], ["kki", "っき"], ["kku", "っく"], ["kke", "っけ"], ["kko", "っこ"],
    // ["ssa", "っさ"], ["sshi", "っし"], ["ssi", "っし"], ["ssu", "っす"], ["sse", "っせ"], ["sso", "っそ"],
    // ["tta", "った"], ["cchi", "っち"], ["tti", "っち"], ["ttsu", "っつ"], ["ttu", "っつ"], ["tte", "って"], ["tto", "っと"],
    // ["ppa", "っぱ"], ["ppi", "っぴ"], ["ppu", "っぷ"], ["ppe", "っぺ"], ["ppo", "っぽ"],
    // Dakuten
    ["ga", "が"], ["gi", "ぎ"], ["gu", "ぐ"], ["ge", "げ"], ["go", "ご"],
    ["za", "ざ"], ["ji", "じ"], ["zu", "ず"], ["ze", "ぜ"], ["zo", "ぞ"],
    ["da", "だ"], ["di", "ぢ"], ["du", "づ"], ["de", "で"], ["do", "ど"],
    ["ba", "ば"], ["bi", "び"], ["bu", "ぶ"], ["be", "べ"], ["bo", "ぼ"],
    // Handakuten
    ["pa", "ぱ"], ["pi", "ぴ"], ["pu", "ぷ"], ["pe", "ぺ"], ["po", "ぽ"],
    // Yōon
    ["kya", "きゃ"], ["kyu", "きゅ"], ["kyo", "きょ"],
    ["sha", "しゃ"], ["shu", "しゅ"], ["sho", "しょ"],
    ["cha", "ちゃ"], ["chu", "ちゅ"], ["cho", "ちょ"],
    // ["nya", "にゃ"], ["nyu", "にゅ"], ["nyo", "にょ"],
    ["んya", "にゃ"], ["んyu", "にゅ"], ["んyo", "にょ"],
    ["ん'ya", "んや"], ["ん'yu", "んゆ"], ["ん'yo", "んよ"],
    ["hya", "ひゃ"], ["hyu", "ひゅ"], ["hyo", "ひょ"],
    ["mya", "みゃ"], ["myu", "みゅ"], ["myo", "みょ"],
    ["rya", "りゃ"], ["ryu", "りゅ"], ["ryo", "りょ"],
    ["gya", "ぎゃ"], ["gyu", "ぎゅ"], ["gyo", "ぎょ"],
    ["ja", "じゃ"], ["ju", "じゅ"], ["jo", "じょ"],
    ["bya", "びゃ"], ["byu", "びゅ"], ["byo", "びょ"],
    ["pya", "ぴゃ"], ["pyu", "ぴゅ"], ["pyo", "ぴょ"],
    // Tricks
    ["lya", "ゃ"], ["lyu", "ゅ"], ["lyo", "ょ"],
    // Basic kana
    ["ka", "か"], ["ki", "き"], ["ku", "く"], ["ke", "け"], ["ko", "こ"],
    ["sa", "さ"], ["shi", "し"], ["si", "し"], ["su", "す"], ["se", "せ"], ["so", "そ"],
    ["ta", "た"], ["chi", "ち"], ["ti", "ち"], ["tsu", "つ"], ["tu", "つ"], ["te", "て"], ["to", "と"],
    // ["na", "な"], ["ni", "に"], ["nu", "ぬ"], ["ne", "ね"], ["no", "の"],
    ["んa", "な"], ["んi", "に"], ["んu", "ぬ"], ["んe", "ね"], ["んo", "の"],
    ["ん'a", "んあ"], ["ん'i", "んい"], ["ん'u", "んう"], ["ん'e", "んえ"], ["ん'o", "んお"],
    ["ha", "は"], ["hi", "ひ"], ["fu", "ふ"], ["he", "へ"], ["ho", "ほ"],
    ["ma", "ま"], ["mi", "み"], ["mu", "む"], ["me", "め"], ["mo", "も"],
    ["ya", "や"], ["yu", "ゆ"], ["yo", "よ"],
    ["ra", "ら"], ["ri", "り"], ["ru", "る"], ["re", "れ"], ["ro", "ろ"],
    ["wa", "わ"], ["wo", "を"],
    ["n", "ん"], 
    ["a", "あ"], ["i", "い"], ["u", "う"], ["e", "え"], ["o", "お"],
    // Rare & extended kana
    ["wi", "ゐ"], ["we", "ゑ"], ["vu", "ゔ"],
    // chōonpu
    ['-', 'ー']
];

export const sokuon = [
    ['kか', 'っか'],['kき', 'っき'],['kく', 'っく'],['kけ', 'っけ'],['kこ', 'っこ'],
    ['sさ', 'っさ'],['sし', 'っし'],['sす', 'っす'],['sせ', 'っせ'],['sそ', 'っそ'],
    ['tた', 'った'],['cち', 'っち'],['tち', 'っち'],['tつ', 'っつ'],['tて', 'って'],['tと', 'っと'],
    ['pぱ', 'っぱ'],['pぴ', 'っぴ'],['pぷ', 'っぷ'],['pぺ', 'っぺ'],['pぽ', 'っぽ'],
];